--ЗАДАНИЕ 1: Посчитайте количество зданий, где установлено 2 и более типа счетчиков. 
SELECT * FROM SOMETABLE
/*ЗАДАНИЕ 2 (JOIN): Представим, что мы решили построить модель на этих данных и хотим собрать все признаки в кучу 
за последние день 2016 года. (если менее 5гб свободной оперативки, можете добавить ещё фильтры к основной таблице)
Соединить между собой все три таблицы (measurement_results, building_metadata, weather_train), 
с фильтром по дате от 30 декабря 2016 года. 
Учитывайте, что measurement_results является основной таблицей, где находится целевая переменная. 
*/
SELECT * FROM SOMETABLE
/*ЗАДАНИЕ 3 (WITH): Давайте по генерируем гипотезы на основе наших данных! (не более 2ух - не нужно придумывать, те которые сложно посчитать).
Попробуем используя конструкцию WITH в одном запросе получить:
	2.1 Основную часть данных, которая состоит из:
		- идентификатор здания
		- тип счетчика
		- целевая переменная (показания счетчика)
	2.2 Запрос насчитывающий признак №1
	2.3 Запрос насчитывающий признак №2
Объединить все в один набор данных.
*/
SELECT * FROM SOMETABLE
--ЗАДАНИЕ 4: Посчитайте накопительную сумму(используя оконную функцию) для каждого здания и типа счетчика.
SELECT * FROM SOMETABLE
/*ЗАДАНИЕ 5 (WITH): Напишите запрос(используя оконные функции), 
который уберет все дублирующие записи по полям building_id, meter 
и вернет самое новое значение.
*/
SELECT * FROM SOMETABLE
